Tekla Open API Reference for Tekla Structures 2025
ComponentItem.Export Method
 Exports the custom component item in *.uel-format to the to given file name. If path is not given custom component is exported to model folder. If filename is empty custom component name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool Export(
	ref string filename
)
Public Overridable Function Export (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the component item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           ComponentItem item = new ComponentItem();
           int version = 0;
           string componentName = "General_Tie";
           if (item.Select(componentName, -1))
           {
               string filename = System.IO.Path.GetTempPath() + "\\" + componentName;
               if (item.Export(ref filename))
               {
                   Console.WriteLine("Custom component exported successfully");
               }
           }
       }
}
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace